---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.GetSegments
source: html/d3b76c87-8008-d3a0-a3f7-663c3714ae9e.htm
---
# Autodesk.Revit.DB.FillGrid.GetSegments Method

Gets the segments of the fill grid.

## Syntax (C#)
```csharp
public IList<double> GetSegments()
```

## Returns
The segments.